#!/bin/bash

apt update -y
apt install -y nginx

cat <<EOF > /var/www/html/index.html
<html>
<head>
<meta charset="UTF-8">
<title>SEIR-I Node</title>
<style>
body {
background-color:black;
color:#00ff00;
font-family:monospace;
padding:40px;
}
</style>
</head>

<body>

<pre>

Initializing Cloud Node...
" he fixed it ..?"
Connecting to GCP Infrastructure...
Loading System Modules...

██████╗██╗  ██╗███████╗██╗    ██╗██████╗  █████╗  ██████╗ ██████╗  █████╗ 
██╔════╝██║  ██║██╔════╝██║    ██║██╔══██╗██╔══██╗██╔════╝██╔════╝ ██╔══██╗
██║     ███████║█████╗  ██║ █╗ ██║██████╔╝███████║██║     ██║      ███████║
██║     ██╔══██║██╔══╝  ██║███╗██║██╔══██╗██╔══██║██║     ██║      ██╔══██║
╚██████╗██║  ██║███████╗╚███╔███╔╝██████╔╝██║  ██║╚██████╗╚██████╗ ██║  ██║
 ╚═════╝╚═╝  ╚═╝╚══════╝ ╚══╝╚══╝ ╚═════╝ ╚═╝  ╚═╝ ╚═════╝ ╚═════╝ ╚═╝  ╚═╝

System Status: ONLINE

You have prevented yourself from getting teabagged.

</pre>

</body>
</html>
EOF

systemctl restart nginx